Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказПоставщику</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АС_ТребоватьКоличествоДнейНаВозврат</Name>
					<Comment>Технический признак: в новых заказах поставщику срок возврата обязателен, в созданных до доработки — нет.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АС_Поступление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС_КоличествоДнейНаВозврат</Name>
							<Comment>Срок возврата поставщику в календарных днях от даты фактического поступления.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПоставщику/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ПередЗаписью")
Процедура АС_ПередЗаписьюПосле(Отказ, РежимЗаписи, РежимПроведения)

	Если Отказ
		Или ОбменДанными.Загрузка
		Или РежимЗаписи <> РежимЗаписиДокумента.Проведение
		Или Не ЗначениеЗаполнено(Контрагент)
		Или ВРег(СокрЛП(Контрагент.Наименование)) <> ВРег("Рынок") Тогда
		Возврат;
	КонецЕсли;

	// Для поставщика "Рынок" дата заранее неизвестна, но период движения
	// регистра не может быть пустым. Максимальная дата означает "срок не задан".
	ТехническаяДатаПоступления = Дата(3999, 12, 31);
	Для Каждого СтрокаЗапаса Из Запасы Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗапаса.ДатаПоступления) Тогда
			СтрокаЗапаса.ДатаПоступления = ТехническаяДатаПоступления;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура АС_ОбработкаПроверкиЗаполненияПосле(Отказ, ПроверяемыеРеквизиты)

	Если ЗначениеЗаполнено(Контрагент)
		И ВРег(СокрЛП(Контрагент.Наименование)) = ВРег("Рынок") Тогда
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(
			ПроверяемыеРеквизиты, "Запасы.Цена");
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(
			ПроверяемыеРеквизиты, "ОтмененныеЗапасы.Цена");
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(
			ПроверяемыеРеквизиты, "Запасы.ДатаПоступления");
		ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизит(
			ПроверяемыеРеквизиты, "ДатаПоступления");
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		// Копия старого заказа тоже считается новым заказом и не должна обходить проверку.
		АС_ТребоватьКоличествоДнейНаВозврат = Истина;
	КонецЕсли;

	Если Не АС_ТребоватьКоличествоДнейНаВозврат Тогда
		Возврат;
	КонецЕсли;

	ПодходящаяНоменклатура = НоменклатураВДокументахСервер.НоменклатураТабличнойЧастиПоТипу(
		ЭтотОбъект,
		Перечисления.ТипыНоменклатуры.Запас);

	Для Каждого СтрокаЗапасы Из Запасы Цикл
		Если ПодходящаяНоменклатура.Найти(СтрокаЗапасы.Номенклатура) = Неопределено
			Или СтрокаЗапасы.АС_КоличествоДнейНаВозврат > 0 Тогда
			Продолжить;
		КонецЕсли;

		КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			"Запасы",
			СтрокаЗапасы.НомерСтроки,
			"АС_КоличествоДнейНаВозврат");
		ТекстСообщения = НСтр("ru = 'В строке товаров не заполнено количество дней на возврат.'");
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			КонтекстноеПоле,
			,
			Отказ);
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
